# CLI tools
brew "awscli"
brew "docker"
brew "docker-compose"
brew "docker-credential-helper"
brew "fd"
brew "fzf"
brew "gh"
brew "ghq"
brew "git"
brew "hyperfine"
brew "jq"
brew "lazygit"
brew "libgit2"
brew "mise"
brew "mkcert"
brew "mysql-client"
brew "mysql@8.4"
brew "ripgrep"
brew "sheldon"
brew "starship"
brew "tig"
brew "tmux"

# Casks
cask "aws-vault"
cask "claude-code"
cask "font-hack-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "ngrok"
cask "visual-studio-code"

# VSCode extensions
vscode "bierner.markdown-mermaid"
vscode "biomejs.biome"
vscode "databricks.databricks"
vscode "dbaeumer.vscode-eslint"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "eriklynd.json-tools"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "mechatroner.rainbow-csv"
vscode "medo64.render-crlf"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "naumovs.color-highlight"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "steoates.autoimport"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "usernamehw.errorlens"
vscode "vitest.explorer"
vscode "vscodevim.vim"
vscode "vsls-contrib.codetour"
